Autodesk.Revit.DB.DocumentValidation.CanDeleteElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates if an element can be deleted.
document:
The document.
elementId:
The id of the element to check.
Returns:
True if the element can be deleted, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DocumentValidation
Utility functions with document validation
Since:
2015